
# print("Ввод цены 1 кг конфет")
# candy=int(input()) # 1000
# print("Ввод цены 1 кг печенья")
# cookies=int(input()) # 1500

# print("покупка 300 грамм конфет и 400 грамм печенья")
# purchase1=candy*0.3 + cookies*0.4 #1000*0,3=300
# # 0.4*1500=600
# #300+600=900
# print(purchase1)



#Пример1
# Напишите программу которая принимает одно число, через int(input())
# далее увеличивает ее на 1
# и уменьшает на 2
# num=int(input())
# num+=1
# num-=2
# print(num)
# 4+1=5
# 5-2=3

#Задание1
# Напишите программу которая принимает одно число, через int(input())
# далее увеличивает ее на 5
# и уменьшает на 2



#Пример2
# Напишите программу которая принимает одно число, через int(input())
# далее умножает ее на 2
# и делить на 3
# num=int(input())
# num*=2
# num/=3
# print(num)
# 6*2=12
# 12/3=4

#Задание2
# Напишите программу которая принимает одно число, через int(input())
# далее умножает ее на 4
# и делить на 2


#Пример3
# Напишите программу которая принимает два число, через int(input())
# если они равны то выводить их, то выводить строку "эти числа равны"
# если они не равны, то выводить строку строку "эти числа не равны"
# num1=int(input())
# num2=int(input())
# if num1==num2: #если num1 равен num2 3==3 true  3==4 false
#     print("эти числа равны")
# else: # то num1 не равен num2
#     num1=num1-1
#     num2
#     print("эти числа не равны")

#Задание3
# Напишите программу которая принимает два число, через int(input())
# если они равны , то увеличить оба числа на 1
# если они не равны, то уменьшить обе числа на 1


# a=1
# = оператор присванивания
# == оператор сравнения

  # если они равны , то увеличить оба числа становиьтся 7
# если они не равны, то уменьшить обе числа  становиьтся 6

# num1=int(input())
# num2=int(input())
# if num1==num2:
#   num1=num1+1
#   num2=num2+1
# else:
#   num1=num1-1
#   num2=num2-1
# print(num1,num2)

# Пример1. У вас есть строка a, a="apple". Ее значение "apple".
# Выводите строку через функцию print().
# a='apple'
# print(a)

# Задание1. У вас есть строка b. Ее значение равна "book". Нужно вывести ее через функцию print().



# Пример2.У вас есть строка a, a="apple". Ее значение "apple". Выводите #длину строки через функцию len.

# a="win23 @" # 3 буквы 2 цифры 1 пробел и 1 символ
# print(len(a))
#Задание2
# У вас есть строка b. Ее значение равна "book". Выводите длину строки #через функцию len.

#Пример3
# У вас есть две строки a и b. (a="apple" b="red"). Нужно вывести строку #"red apple". Это делается с помощью функций print().
# a="apple"
# b="red"
# print(b+" "+a)
# print(a+" "+b)
# #Задание3
# # У вас есть 2 строки a и b. a="red" b="car". Нужно вывести строку
# #"red car".
# a="red"
# b="car"
# print(a+' '+b)

# Пример4. У вас есть переменная a.  Метод upper() выводить все буквы в строке большими буквами.
# a='apple'
# print(a.upper())
#Задание4
# У вас есть строка b (b="book"). Нужно вывести все буквы с большой #буквой это нужно сделать с помощью метода upper().
#верхний регистром

# Пример5
# У вас есть переменная a.  Метод lower() выводить все буквы в строке маленькими буквами.
a="APPLE"
print(a.lower())
#Задание5
# У вас есть строка b (b="BOOK"). Нужно вывести все буквы с маленькой буквой это нужно сделать с помощью метода lower().

