# Пример1
#
# str='WINter'
# print(str.upper())
# print(str.lower())

# Задание1
# str='NEW year'

# 1) вывыести строку 'NEW YEAR'
# 2) вывести строку 'new year'

# Пример2
# num1=8
# num2=7
# if num1!=num2: # num1 не равен num2     8!=7 true
#   print("они не равны")
# else: # num1 равен num2
#   print("они равны")

# Задание2
# ввод двух чисел
# и проверить не равны ли они друг другу с помощью !=

# num1=6
# num2=6
# if num1!=num2:
#   print("они не равны")
# else:
#   print("они равны")


# Пример3
# вы вводите строку
# и проверяете данная строка больше 5 или нет
# str1=input()
# if len(str1)>5:
#   print("его длина строки больше 5")
# else:
#   print("его длина строки меньше или равна 5")

# Задание3
# вы вводите строку
# и проверяете данная строка меньше 7 или нет
#
# a='яблоко' # len('яблоко')=6
# if len(a)!=7: #  6!=7 : правда true истина
#   print("true")
# else:
#   print('false')


# Пример4
# num1=6
# num2=0       # 0>0 false
# if num1>0 and num2>0: # true and false --> false
#   print("оба числа больше нуля")
# else:
#   print("как минимум одно число меньше или равно нулю")
# Задание4
# вы вводите два числа
# и проверяете числа , оба ли числа меньше 10  или нет
# если оба числа меньше 10 , то вывести строку " оба меньше 10 "
# если это не так , то вывести строку "как минимум одно из них больше или #равна 10"

# Пример5
num1 = -5
num2 = -7
if num1 > 0 or num2 > 0:  # false или false --> false
    print("одно из них больше нуля")
else:
    print("оба числа меньше нуля")
# Задание5

# вы вводите два числа
# и проверяете числа , есть ли хотя бы одно число которое больше 5
# если одно или оба числа больше 5,то вывести строку "один их них больше 5"
# если это не так , то вывести строку "оба числа меньше 5"

