#Вложенные условия
number=-103
if number>0: # цисло больше нуля
    if number>10: #число больше 10
        print('это число больше 10')
    else: # число меньше 10 и при этом он больше нуля
        print('число между 0 и 10 ')
else: #если число меньше нуля
    if number>-10: # число больше -10 и при этом меньше нуля
        print('число между -10 и 0')
    else:# число меньше -10
        print('число меньше -10')
#Задание
# у вас есть число number вы должны проверить его если


#у вас есть три переменные a,b,c
a=int(input())
b=int(input())
c=int(input())
#найдите максимальное число с помощью вложенных условий

