#while
# print('winter') # 1 итерация
# print('winter')# 1 итерация
# print('winter')
# print('winter')
# print('winter')
# Пример1 вывести числа от 0 до 2
# i=0
# while i<3: # 0<3 true, i=1 1<3 true, i=2 2<3 true, i=3 3<3 false
#     print('winter',i) # 1 2 3
#     i=i+1 # i=1 i=2 i=3
#работать со строками, списками(листами)
# их индексация начинается с ноля
#Задание 1 вывести числа от 0 до 4
#0
# 1
# 2
# 3
# 4

#Пример 2 вывести числа от 3 до 7
# 3
# 4
# 5
# 6
# 7 <8
i=3
while i<8:
    print(i)
    i+=1

#Задание 2 вывести числа от 2 до 6
# 2 3 4 5 6

#Пример 3 вывести числа от 6 до 0
# 6
# 5
# 4
# 3
# 2
# 1
# 0
i=6
while i>=0: # 6  5 4 3 2 1 0  -1>=0 False
    print(i) # 6 5 4 3 2 1 0
    i=i-1 # i=5 i=4 i=3 i=2 i=1 i=0 i=-1
#Задание 3 вывести числа от 6 до 3

#Пример вывести от 0 до 6 с интервалом 2
# 0
# 2
# 4
# 6
# i=0
# while i<7: # 0<7 2<7 4<7 6<7  ,      8<7 false
#     print(i) # 0 2 4 6
#     i=i+2 # i=2 4 6 8

#Задание вывести от 1 до 7 с интервалом 2
# 1
# 3
# 5
# 7














