#Пример1
# Напишите программу которая принимает одно число, через int(input())
# далее увеличивает ее на 1
# и уменьшает на 2
# num=int(input())
# num+=1
# num-=2
# print(num)
#Задание1
# Напишите программу которая принимает одно число, через int(input())
# далее увеличивает ее на 5
# и уменьшает на 2

#Пример2
# Напишите программу которая принимает одно число, через int(input())
# далее умножает ее на 2
# и делить на 3
# num=int(input())
# num*=2
# num/=3
# print(num)

#Задание2
# Напишите программу которая принимает одно число, через int(input())
# далее умножает ее на 4
# и делить на 2

#Пример3
# Напишите программу которая принимает два число, через int(input())
# если они равны то выводить их, то выводить строку "эти числа равны"
# если они не равны, то выводить строку строку "эти числа не равны"
num1=int(input())
num2=int(input())
if num1==num2:
    print("эти числа равны")
else:
    print("эти числа не равны")

#Задание3
# Напишите программу которая принимает два число, через int(input())
# если они равны , то увеличить оба числа на 1
# если они не равны, то уменьшить обе числа на 1
