# math functions
# математические функции
#Пример1
# abs  он возводить все числа в положительное значение
# он возвращает модуль значение
# a=-2.5
# print(abs(a))
#Задание1
# вводите число и возвращаете модуль значение этого числа с помощью abs

# abs сокращенно absolute value
# absolute value - положительное число

#Пример2
# min возвращает минимальное значение
# a=min(3,5,1,-8,90,91)
# print(a)
#Задание2
# числа 8,3,6 нужно вывести минимальное значение с помощью min

#Пример3
#max возвращает максимальное значение
# a=max(2,7,1)
# print(a)
#Задание3
# числа 3,1,10 нужно вывести максимальное значение с помощью max

#Пример4
# pow степень значения (число, степень)
# вывести 2 в степени 3
# a=pow(2,3)
# print(a)
#Задание4
# вывести 4 в степени 2
#
#вывести 3 в степени 5

#Пример5
# round - округляет значение
# a=float(input())
# print(round(a))
# b=3.6
# print(round(b))
#Задание5
# введите число 3.3 и 8.6 и округлите их
#float(input())

#
# a=float(input())
# print(round(a))
# вы вводите через float(input())
# и округляете его.

# Известно, что x кг конфет стоит a рублей. Определите, сколько стоит y кг этих конфет,
# а также сколько кг конфет можно купить на k рублей. Все значения вводит пользователь.
# x=int(input()) # кг конфет
# a=int(input()) # рубли за x кг
# y=int(input()) # другие кг
# rublesfory=(y*a)/x # стоимость y кг конфет
# print(rublesfory,'рублей за ', y, 'кг этих конфет')
# k=int(input()) # какие-то рубли
# kkilogramms=x*k/a
# print(kkilogramms, ' кг можно купить за ', k, ' рублей' )

