# Пример1
# count- возвращать количество заданного элемента в строке
# посчитать сколько букв 'p' есть в  строке
# str1='python programm'
# print("количество букв p в строке:")
# print(str1.count('p'))
# Задание1
# посчитать сколько букв 't' есть в строке
# str2='task and tea'


#Пример2
# вам нужно посчитать сколько есть слов 'is'
# str1 = "Python is awesome, isn't it?"
# count1 = str1.count('is') #
# print("The count is:", count1)
# # Задание2
# str2='coffee in coffee shop'
# вам нужно посчитать сколько есть слов 'coffee'

#Пример3
# str='WINter'
# print(str.upper())
# print(str.lower())
#
# isupper() - для проверки является ли строка или часть строки верхним регистром(большой буквой)
# islower()- для проверки является ли строка или часть строки нижним регистром(маленькой буквой)
# str1='WINTEr'
# if str1.isupper():# в строке str1 все ли буквы большие
#     print('все буквы строки большие')
# else: # как минимум одно буква маленькая
#     print('не все буквы строки большие')
#Задание3
#вводите строку
# и проверяете все ли буквы строки маленькие( с нижним регистром)

#Пример4
# вводим 2 строки
# проверяем длина обоих строк больше пяти или нет
# str1=input()
# str2=input()
# if len(str1)>5 and len(str2)>5: # у обоих строк длина строки больше 5
#     print('длина обоих строк больше 5')
# else: # как минимму у одной строки длина строки меньше или равна 5
#     print('у одной из строк длина строки меньше или равна 5 ')
#Задание4
# вводим 2 строки
# проверяем длина обоих строк меньше 8 или нет

# str1=input()
# str2=input()
# if str1.isupper() and str2.isupper():
#     print()

# a=5
# b=6
# if a>b: # если первое число больше
#     print('первое число больше') # первое число
# elif a==b:
#     print('они равны')
# else: # если второе число больше
#     print('второе число больше')# второе число
# вводим 2 строки
# написать программу которая выведить чья длина строки больше
