#Пример1
# округлили 2.392 до 2.4 до десятых чисел
# a=2.392
# print(round(a,1)) # если добавить округления до десятых чисел
# #Задание1
# b=4.671
#округлить до 4.7 то есть десятых чисел

#Пример2
# округлили 5.468  до 5.47 ,то есть до сотых чисел
# a=5.468
# print(round(a,2))
# #Задание2
# b=6.184
#округлить 6.184 до 6.18, то есть до сотых чисел
#Пример 3
#округлили 461.89 до 460
# a=467.89
# print(round(a,-1))
# #Задание3
# b=201.45
#округлить 201.45 до 200

#Пример4
#округлили 379 до 400
a=379
print(round(a,-2))
# #Задание4
# b=467
#округлить 467 до 500
#Пример5
#end – ставится после всех объектов;
# end параметр соединяет два строки в одну строку каким -то символом(который указан в end)
# print("apple", end=' and ')
# print("map")
# print("python")
#Задание5
# print(3)
# print(2)
#Задание5
# вывести строку '3-2' с помощью end

