#Пример1
#Таким образом, необязательный параметр sep команды print()
# позволяет установить строку, с помощью которой будут разделены аргументы при печати

#параметер sep добавляет свой символ между нашими значениями
# print(2,3,4 ,sep='+')
# # #2?3?4
# print('apple','this','mine',sep='+')
# #apple+this+mine
# #Задание1
# вывод 8-9-3
# print(7,8,1, sep='/')

#Пример2
# вывести строку 'apple is yellow'  чтобы 'is' было в параметре sep
# print('apple','yellow', sep=' is ')

#Задание2
# вывести строку 'python is good'  чтобы 'is' было в параметре sep


#Пример3
# print(890+10) # int  900
# print('890'+'10') # str 89010
# #Задание3
# вам нужно вывести 90+10
#                   '90'+'10'

#Пример4
# вам нужно вывести строку 'у меня есть 10 долларов и 5 центов'
# a=10
# b=5
# print('у меня есть',a,'долларов и',b,'центов')
# #
# # #Задание4
# a=20
# b=10
# вам нужно вывести строку 'Завтра в 20 часов и 10 минут'



#Пример5
a=8
b=10
print('завтра %s сентября в %s часов'%(a,b))
# #Задание5
a=5
b=7
#вывести следующую строку
# завтра 5 января в 7 часов
